; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	image1 - mode
	infrared2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Star0 - direction
	GroundStation4 - direction
	Star3 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Phenomenon7 infrared2)
	(have_image Star8 image1)
	(have_image Star9 spectrograph0)
	(have_image Planet10 image1)
	(have_image Planet11 image1)
	(have_image Planet12 infrared2)
	(have_image Phenomenon13 infrared2)
))

)

; plan
1. (turn_to satellite2 star3 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star3)
   goals met: 0 of 8
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite2 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite2 planet10 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet10)
   goals met: 0 of 8
5. (take_image satellite2 planet10 instrument2 image1)
   added: (have_image planet10 image1)
   goals met: 1 of 8
6. (turn_to satellite2 phenomenon7 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon7)
   goals met: 1 of 8
7. (take_image satellite2 phenomenon7 instrument2 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 2 of 8
8. (turn_to satellite2 phenomenon13 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 8
9. (take_image satellite2 phenomenon13 instrument2 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 3 of 8
10. (turn_to satellite0 groundstation4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 8
11. (turn_to satellite2 planet11 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet11)
   goals met: 4 of 8
12. (take_image satellite2 planet11 instrument2 image1)
   added: (have_image planet11 image1)
   goals met: 5 of 8
13. (turn_to satellite2 planet12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet12)
   goals met: 5 of 8
14. (take_image satellite2 planet12 instrument2 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 6 of 8
15. (turn_to satellite2 star8 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star8)
   goals met: 6 of 8
16. (take_image satellite2 star8 instrument2 image1)
   added: (have_image star8 image1)
   goals met: 7 of 8
17. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 7 of 8
18. (take_image satellite2 star9 instrument2 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 8 of 8
